Repository: kotta-23/pymemuc
Catalog: docs/source/locales/*/LC_MESSAGES/index.po
Languages: ru

source: A Python API for MEmu Android Emulator. The API exposes `MEmu Command <https://www.memuplay.com/blog/memucommand-reference-manual.html>`_ functionality in Python.
ru: Python API для MEmu Android Emulator. Этот API предоставляет функциональность `MEmu Command <https://www.memuplay.com/blog/memucommand-reference-manual.html>`_ на языке Python.

source: Allows for easy interaction with MEmu VMs, including VM image management, VM control, running VM commands and ADB interaction.
ru: Обеспечивает легкое взаимодействие с MEmu VM, включая управление образами VM, управление VM, выполнение команд VM и взаимодействие с ADB.

source: Contents
ru: Содержание

source: Contribute
ru: Внести вклад

source: If you are having any problems or wish to see added features, `find or open an issue <https://github.com/pyclashbot/pymemuc/issues>`_.
ru: Если у вас возникли проблемы или вы хотели бы видеть добавленные функции, `найдите или откройте issue <https://github.com/pyclashbot/pymemuc/issues>`_.

source: Looking to contribute directly? Open a pull request in the `repository <https://github.com/pyclashbot/pymemuc>`_.
ru: Хотите внести вклад напрямую? Откройте pull request в `репозитории <https://github.com/pyclashbot/pymemuc>`_.

source: Support
ru: Поддержка

source: If you are having issues, please let us know. This project is still in development.
ru: Если у вас возникли проблемы, пожалуйста, дайте нам знать. Этот проект все еще находится в стадии разработки.

source: License
ru: Лицензия

source: The project is licensed under the MIT license.
ru: Проект лицензирован под лицензией MIT.
