Repository: kotta-23/pymemuc
Catalog: docs/source/locales/*/LC_MESSAGES/pymemuc.po
Languages: ru

source: Documentation
ru: Документация

source: The ``PyMemuc`` module
ru: Модуль ``PyMemuc``

source: a wrapper for memuc.exe as a library to control virtual machines
ru: Оболочка для memuc.exe в виде библиотеки для управления виртуальными машинами

source: Bases: :py:class:`object`
ru: Основы: :py:class:`object`

source: A class to interact with the memuc.exe command line tool to control virtual machines.
ru: Класс для взаимодействия с инструментом командной строки memuc.exe для управления виртуальными машинами.

source: Parameters
ru: Параметры

source: Path to memuc.exe. Set to None for autodetect.
ru: Путь к memuc.exe. Установите в None для автоопределения.

source: Enable debug mode, defaults to False
ru: Включить режим отладки, по умолчанию False

source: Change the GPS location on a VM, must specify either a vm index or a vm name
ru: Изменить местоположение GPS на виртуальной машине, необходимо указать индекс VM или имя VM

source: Latitude
ru: Широта

source: Longitude
ru: Долгота

source: VM index. Defaults to None.
ru: Индекс VM. По умолчанию None.

source: VM name. Defaults to None.
ru: Имя VM. По умолчанию None.

source: Raises
ru: Вызывает

source: an error if neither a vm index or a vm name is specified
ru: ошибка, если не указан ни индекс, ни имя VM

source: Returns
ru: Возвращает

source: True if the vm GPS change was successful
ru: True, если изменение GPS виртуальной машины прошло успешно

source: Return type
ru: Тип возвращаемого значения

source: Connect the internet on a VM, must specify either a vm index or a vm name
ru: Подключить интернет на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: True if the vm internet connection was successful
ru: True, если подключение к интернету виртуальной машины прошло успешно

source: Create an app shortcut on a VM, must specify either a vm index or a vm name
ru: Создать ярлык приложения на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: Package name
ru: Имя пакета

source: an error if the command times out
ru: ошибка, если команда завершается по таймауту

source: the return code and the output of the command.
ru: код возврата и вывод команды.

source: Disconnect the internet on a VM, must specify either a vm index or a vm name
ru: Отключить интернет на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: Execute a command on a VM, must specify either a vm index or a vm name
ru: Выполнить команду на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: Command to execute
ru: Команда для выполнения

source: Get the adb connection information for a VM
ru: Получить информацию о подключении adb для виртуальной машины

source: Timeout for the command. Defaults to None.
ru: Таймаут для команды. По умолчанию - None.

source: an error if the command fails
ru: ошибка, если команда завершается неудачно

source: the ip and port of the adb connection as a tuple
ru: IP-адрес и порт соединения adb в виде кортежа

source: Get the list of apps installed on a VM, must specify either a vm index or a vm name
ru: Получить список установленных приложений на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: Timeout for the command. Defaults to 10.
ru: Таймаут для команды. По умолчанию - 10.

source: an error if the command failed
ru: ошибка, если команда завершается неудачно

source: the list of packages installed on the VM
ru: список установленных пакетов на виртуальной машине

source: Get the public IP of a VM, must specify either a vm index or a vm name
ru: Получить публичный IP виртуальной машины, необходимо указать индекс или имя виртуальной машины

source: Input text on a VM, must specify either a vm index or a vm name
ru: Ввести текст на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: Text to input
ru: Текст для ввода

source: True if the vm text input was successful
ru: True, если ввод текста на виртуальной машине прошел успешно

source: Install an APK on a VM, must specify either a vm index or a vm name
ru: Установить APK на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: Path to the APK
ru: Путь к APK

source: Whether to create a shortcut. Defaults to False.
ru: Создавать ли ярлык. По умолчанию - False.

source: True if the vm apk installation was successful
ru: True, если установка APK на виртуальной машине прошла успешно

source: Rotate the window on a VM, must specify either a vm index or a vm name
ru: Повернуть окно на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: True if the vm window rotation was successful
ru: True, если поворот окна виртуальной машины прошел успешно

source: Send an ADB command to a VM, must specify either a vm index or a vm name
ru: Отправить команду ADB на виртуальную машину, необходимо указать индекс или имя виртуальной машины

source: ADB command
ru: Команда ADB

source: Set the accelerometer on a VM, must specify either a vm index or a vm name
ru: Установить акселерометр на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: the accelerometer value to set
ru: значение акселерометра для установки

source: Sort out all VMs
ru: Упорядочить все виртуальные машины

source: Start an app on a VM, must specify either a vm index or a vm name
ru: Запустить приложение на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: Package name of the APK
ru: Имя пакета APK

source: Timeout in seconds. Defaults to None.
ru: Таймаут в секундах. По умолчанию - None.

source: True if the vm app start was successful
ru: True, если запуск приложения на виртуальной машине прошел успешно

source: Stop an app on a VM, must specify either a vm index or a vm name
ru: Остановить приложение на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: True if the vm app stop was successful
ru: True, если остановка приложения на виртуальной машине прошла успешно

source: Trigger a keystroke on a VM, must specify either a vm index or a vm name
ru: Запустить нажатие клавиши на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: Key to trigger
ru: Клавиша для запуска

source: True if the vm keystroke trigger was successful
ru: True, если запуск нажатия клавиши на виртуальной машине прошел успешно

source: Trigger a shake on a VM, must specify either a vm index or a vm name
ru: Запустить тряску на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: True if the vm shake trigger was successful
ru: True, если запуск тряски на виртуальной машине прошел успешно

source: Uninstall an APK on a VM, must specify either a vm index or a vm name
ru: Удалить APK на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: True if the vm apk uninstallation was successful
ru: True, если удаление APK на виртуальной машине прошло успешно

source: Zoom in on a VM, must specify either a vm index or a vm name
ru: Увеличить масштаб на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: True if the vm zoom in was successful
ru: True, если увеличение масштаба на виртуальной машине прошло успешно

source: Zoom out on a VM, must specify either a vm index or a vm name
ru: Уменьшить масштаб на виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: True if the vm zoom out was successful
ru: True, если уменьшение масштаба на виртуальной машине прошло успешно

source: Reboot a VM, must specify either a vm index or a vm name
ru: Перезагрузить виртуальную машину, необходимо указать индекс или имя виртуальной машины

source: Whether to run the command in the background. Defaults to False.
ru: Запускать ли команду в фоновом режиме. По умолчанию - False.

source: True if the vm was rebooted successfully
ru: True, если виртуальная машина успешно перезагружена

source: Start a VM, must specify either a vm index or a vm name
ru: Запустить виртуальную машину, необходимо указать индекс или имя виртуальной машины

source: Whether to start the VM in headless mode. Defaults to False.
ru: Запускать ли виртуальную машину в режиме без графического интерфейса. По умолчанию - False.

source: Timeout in seconds. Cannot be used if non blocking. Defaults to None.
ru: Таймаут в секундах. Не может использоваться в неблокирующем режиме. По умолчанию - None.

source: True if the vm was started successfully
ru: True, если виртуальная машина успешно запущена

source: Stop all VMs
ru: Остановить все виртуальные машины

source: an error if the vm stop failed
ru: ошибка, если остановка виртуальной машины не удалась

source: True if the vm was stopped successfully
ru: True, если виртуальная машина успешно остановлена

source: Stop a VM, must specify either a vm index or a vm name
ru: Остановить виртуальную машину, необходимо указать индекс или имя виртуальной машины

source: Clone a VM, must specify either a vm index or a vm name
ru: Клонировать виртуальную машину, необходимо указать индекс или имя виртуальной машины

source: Cloned VM name. Defaults to None.
ru: Имя клонированной виртуальной машины. По умолчанию - None.

source: True if the vm was cloned successfully
ru: True, если виртуальная машина успешно клонирована

source: Compress a VM, must specify either a vm index or a vm name
ru: Сжать виртуальную машину, необходимо указать индекс или имя виртуальной машины

source: an error if the vm compress failed
ru: ошибка, если сжатие виртуальной машины не удалось

source: True if the vm was compressed successfully
ru: True, если виртуальная машина успешно сжата

source: Create a new VM
ru: Создать новую виртуальную машину

source: Android version. Defaults to "96".
ru: Версия Android. По умолчанию - "96".

source: an error if the vm creation failed
ru: ошибка, если создание виртуальной машины не удалось

source: the index of the new VM, -1 if an error occurred but no exception was raised
ru: индекс новой виртуальной машины, -1, если произошла ошибка, но исключение не было вызвано

source: Delete a VM, must specify either a vm index or a vm name
ru: Удалить виртуальную машину, необходимо указать индекс или имя виртуальной машины

source: True if the vm was deleted successfully
ru: True, если виртуальная машина успешно удалена

source: Export a VM, must specify either a vm index or a vm name
ru: Экспортировать виртуальную машину, необходимо указать индекс или имя виртуальной машины

source: File name. Defaults to "vm.ova".
ru: Имя файла. По умолчанию - "vm.ova".

source: the return code and the output of the command
ru: код возврата и вывод команды

source: Get a VM configuration, must specify either a vm index or a vm name
ru: Получить конфигурацию виртуальной машины, необходимо указать индекс или имя виртуальной машины

source: Configuration key, keys are noted in `configuration keys table <https://pymemuc.readthedocs.io/pymemuc.html#the-vm-configuration-keys-table>`_
ru: Ключ конфигурации, ключи приведены в таблице `ключей конфигурации <https://pymemuc.readthedocs.io/pymemuc.html#the-vm-configuration-keys-table>`_

source: The configuration value
ru: Значение конфигурации

source: Import a VM from a file
ru: Импортировать виртуальную машину из файла

source: an error if the vm import failed
ru: ошибка, если импорт виртуальной машины не удался

source: True if the vm was imported successfully
ru: True, если виртуальная машина успешно импортирована

source: List VM info, must specify either a vm index or a vm name
ru: Перечислить информацию о виртуальной машине, необходимо указать индекс или имя виртуальной машины

source: Whether to list only running VMs. Defaults to False.
ru: Перечислять только работающие виртуальные машины. По умолчанию - False.

source: Whether to list disk info. Defaults to False.
ru: Перечислять информацию о диске. По умолчанию - False.

source: a list of VM info, each VM info is a dictionary with the following keys: index: VM index title: VM title top_level: VM top level running: whether the VM is running pid: VM pid disk_usage: VM disk usage
ru: список информации о виртуальной машине, каждая информация о виртуальной машине представляет собой словарь с следующими ключами: index: индекс виртуальной машины title: заголовок виртуальной машины top_level: верхний уровень виртуальной машины running: работает ли виртуальная машина pid: PID виртуальной машины disk_usage: использование диска виртуальной машины

source: Randomize a VM, must specify either a vm index or a vm name
ru: Случайным образом изменить параметры виртуальной машины, необходимо указать индекс или имя виртуальной машины

source: True if the vm was randomized successfully
ru: True, если параметры виртуальной машины успешно изменены случайным образом

source: Rename a VM, must specify either a vm index or a vm name
ru: Переименовать виртуальную машину, необходимо указать индекс или имя виртуальной машины

source: New VM name. Defaults to None.
ru: Новое имя виртуальной машины. По умолчанию - None.

source: an error if neither a vm index or name is specified
ru: ошибка, если не указан индекс или имя виртуальной машины

source: an error if the vm rename failed
ru: ошибка, если переименование виртуальной машины не удалось

source: True if the vm was renamed successfully
ru: True, если виртуальная машина успешно переименована

source: Set a VM configuration, must specify either a vm index or a vm name
ru: Установить конфигурацию виртуальной машины, необходимо указать индекс или имя виртуальной машины

source: Configuration value
ru: Значение конфигурации

source: True if the vm configuration was set successfully
ru: True, если конфигурация виртуальной машины была успешно установлена

source: Check if a VM is running
ru: Проверить, работает ли виртуальная машина

source: VM index. Defaults to 0.
ru: Индекс виртуальной машины. По умолчанию - 0.

source: True if the VM is running, False otherwise
ru: True, если виртуальная машина работает, в противном случае - False

source: Check the status of a task
ru: Проверить статус задачи

source: Asynchronous task ID
ru: Идентификатор асинхронной задачи

source: run a command with memuc.exe. Memuc can support non-blocking commands, returning a task id. A timeout can be specified if memuc is expected to hang, but this will not work with non-blocking commands.
ru: выполнить команду с использованием memuc.exe. Memuc может поддерживать неблокирующие команды, возвращая идентификатор задачи. Время ожидания можно указать, если ожидается, что memuc зависнет, но это не будет работать с неблокирующими командами.

source: a list of arguments to pass to memuc.exe
ru: список аргументов для передачи в memuc.exe

source: whether to run the command in the background. Defaults to False.
ru: запускать ли команду в фоновом режиме. По умолчанию - False.

source: the timeout in seconds. Defaults to None for no timeout.
ru: таймаут в секундах. По умолчанию - None для отсутствия таймаута.

source: an error if the command timed out
ru: ошибка, если команда завершилась по истечении времени ожидания

source: initialize the class, automatically finding memuc.exe if windows registry is supported, otherwise a path must be specified
ru: инициализировать класс, автоматически находя memuc.exe, если поддерживается реестр Windows, в противном случае необходимо указать путь

source: The ``VM Configuration Keys`` table
ru: Таблица ключей конфигурации виртуальной машины

source: VM Configuration Keys
ru: Ключи конфигурации виртуальной машины

source: Key
ru: Ключ

source: Description
ru: Описание

source: ``name``
ru: Имя

source: The name of the VM.
ru: Имя виртуальной машины.

source: The number of CPUs to allocate to the VM.
ru: Количество процессоров для выделения виртуальной машине.

source: The CPU cap to allocate to the VM. (``0``-``100``)
ru: Ограничение процессора для выделения виртуальной машине. (``0``-``100``)

source: The amount of memory to allocate to the VM. (Unit: MB)
ru: Объем памяти для выделения виртуальной машине. (Единица измерения: МБ)

source: Whether the VM should be started in full screen mode. (``1``, ``0``)
ru: Должна ли виртуальная машина запускаться в полноэкранном режиме. (``1``, ``0``)

source: Whether the VM's toolbar should be hidden. (``1``, ``0``)
ru: Следует ли скрывать панель инструментов виртуальной машины. (``1``, ``0``)

source: Whether the VM should be started in turbo mode. (``1``, ``0``)
ru: Следует ли запускать виртуальную машину в турбо-режиме. (``1``, ``0``)

source: The graphics render mode to use. (``1``:DirectX, ``0``:OpenGL)
ru: Режим отображения графики для использования. (``1``:DirectX, ``0``:OpenGL)

source: Whether the VM should be started with super user privileges. (``1``, ``0``)
ru: Должна ли виртуальная машина запускаться с привилегиями суперпользователя. (``1``, ``0``)

source: Whether the VM should be started with audio support. (``1``, ``0``)
ru: Следует ли запускать виртуальную машину с поддержкой звука. (``1``, ``0``)

source: The VM's frames per second. (``0``-``100``)
ru: Количество кадров в секунду виртуальной машины. (``0``-``100``)

source: The VM's virtual keyboard mode. (``0``, ``1``)
ru: Режим виртуальной клавиатуры виртуальной машины. (``0``, ``1``)

source: Whether the VM should be started with time synchronization. (``1``, ``0``)
ru: Должна ли виртуальная машина запускаться с синхронизацией времени. (``1``, ``0``)

source: The VM's phone layout. (``2``: Toolbar, ``1``: Right, ``0``: Bottom)
ru: Расположение телефона виртуальной машины. (``2``: Панель инструментов, ``1``: Справа, ``0``: Снизу)

source: The VM's start window mode. (``2``: Custom, ``1``: Last time, ``0``: Default)
ru: Режим запуска окна виртуальной машины. (``2``: Пользовательский, ``1``: Последний раз, ``0``: По умолчанию)

source: The VM's window X offset from upper-left corner. (``start_window_mode`` != ``0``) (Unit: Pixel)
ru: Смещение окна виртуальной машины по оси X от верхнего левого угла. (``start_window_mode`` != ``0``) (Единица измерения: Пиксели)

source: The VM's window Y offset from upper-left corner. (``start_window_mode`` != ``0``) (Unit: Pixel)
ru: Вертикальное смещение окна виртуальной машины от верхнего левого угла. (``start_window_mode`` != ``0``) (Единица измерения: Пиксели)

source: The VM's window scaling percentage. (Unit: %)
ru: Процентное масштабирование окна виртуальной машины. (Единица измерения: %)

source: Whether the VM should be started with a custom resolution. (``1``, ``0``)
ru: Должна ли виртуальная машина запускаться с пользовательским разрешением. (``1``, ``0``)

source: The VM's custom resolution width. (``is_custom_resolution`` == ``1``) (Unit: Pixel)
ru: Ширина пользовательского разрешения виртуальной машины. (``is_custom_resolution`` == ``1``) (Единица измерения: Пиксели)

source: The VM's custom resolution height. (``is_custom_resolution`` == ``1``) (Unit: Pixel)
ru: Высота пользовательского разрешения виртуальной машины. (``is_custom_resolution`` == ``1``) (Единица измерения: Пиксели)

source: The VM's virtual box DPI. (``is_custom_resolution`` == ``1``) (Unit: DPI)
ru: DPI виртуальной машины. (``is_custom_resolution`` == ``1``) (Единица измерения: DPI)

source: The VM's phone number.
ru: Номер телефона виртуальной машины.

source: The VM's IMEI.
ru: IMEI виртуальной машины.

source: The VM's IMSI.
ru: IMSI виртуальной машины.

source: The VM's SIM serial number.
ru: Серийный номер SIM-карты виртуальной машины.

source: The VM's brand.
ru: Бренд виртуальной машины.

source: The VM's model.
ru: Модель виртуальной машины.

source: The VM's manufacturer.
ru: Производитель виртуальной машины.

source: The VM's selected GPS provider. (``0``: Google, ``1``: Baidu)
ru: Выбранный GPS-провайдер виртуальной машины. (``0``: Google, ``1``: Baidu)

source: The VM's GPS latitude. (Unit: Degree)
ru: Широта GPS виртуальной машины. (Единица измерения: Градусы)

source: The VM's GPS longitude. (Unit: Degree)
ru: Долгота GPS виртуальной машины. (Единица измерения: Градусы)

source: The path to the VM's shared picture path.
ru: Путь к общему каталогу изображений виртуальной машины.

source: The path to the VM's shared music path.
ru: Путь к общему каталогу музыки виртуальной машины.

source: The path to the VM's shared movie path.
ru: Путь к общему каталогу фильмов виртуальной машины.

source: The path to the VM's shared download path.
ru: Путь к общему каталогу загрузок виртуальной машины.

source: The ``VMInfo`` type
ru: Тип данных ``VMInfo``

source: Bases: :py:class:`~typing.TypedDict`
ru: Базовый класс: :py:class:`~typing.TypedDict`

source: A TypedDict for VM info
ru: TypedDict для информации о виртуальной машине

source: VM index
ru: Индекс виртуальной машины

source: VM title
ru: Название виртуальной машины

source: VM top level window
ru: Верхнее окно виртуальной машины

source: VM is running
ru: Виртуальная машина запущена

source: VM process ID
ru: Идентификатор процесса виртуальной машины

source: VM disk usage in bytes
ru: Использование диска виртуальной машины в байтах
